## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 3 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           RESOURCE                            |
|--------|---------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.superset_docs`                     |
|        | `aws_cloudwatch_event_target.superset_docs`                   |
|        | `aws_lambda_permission.superset_docs`                         |
| update | `aws_cloudwatch_metric_alarm.superset_docs_errors`            |
|        | `aws_cloudwatch_metric_alarm.superset_docs_invocation_errors` |
|        | `module.superset_docs.aws_lambda_function.this`               |
| delete | `aws_cloudwatch_metric_alarm.superset_docs_health_check`      |
|        | `aws_route53_health_check.superset_docs`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.superset_docs will be created
  + resource "aws_cloudwatch_event_rule" "superset_docs" {
      + arn                 = (known after apply)
      + description         = "Keep the function toasty warm"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "invoke-superset-docs"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.superset_docs will be created
  + resource "aws_cloudwatch_event_target" "superset_docs" {
      + arn            = "arn:aws:lambda:ca-central-1:257394494478:function:cds-superset-docs"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode({})
      + rule           = "invoke-superset-docs"
      + target_id      = "invoke-lambda"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_errors will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_docs_errors" {
      ~ actions_enabled                       = false -> true
        id                                    = "errors-superset-docs"
        tags                                  = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_docs_health_check will be destroyed
  # (because aws_cloudwatch_metric_alarm.superset_docs_health_check is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "superset_docs_health_check" {
      - actions_enabled                       = false -> null
      - alarm_actions                         = [
          - "arn:aws:sns:us-east-1:257394494478:cloudwatch-alert-warning",
        ] -> null
      - alarm_description                     = "`superset-docs` heath check has failed in a 2 minute period." -> null
      - alarm_name                            = "health-check-superset-docs" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-1:257394494478:alarm:health-check-superset-docs" -> null
      - comparison_operator                   = "LessThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "HealthCheckId" = "5d446801-7f3d-4680-bd2e-273be959d5b3"
        } -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "health-check-superset-docs" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "HealthCheckStatus" -> null
      - namespace                             = "AWS/Route53" -> null
      - ok_actions                            = [
          - "arn:aws:sns:us-east-1:257394494478:cloudwatch-alert-ok",
        ] -> null
      - period                                = 60 -> null
      - statistic                             = "Minimum" -> null
      - tags                                  = {
          - "CostCentre" = "cds-superset-docs-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                              = {
          - "CostCentre" = "cds-superset-docs-staging"
          - "Terraform"  = "true"
        } -> null
      - threshold                             = 1 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.superset_docs_invocation_errors will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "superset_docs_invocation_errors" {
      ~ actions_enabled                       = false -> true
        id                                    = "invocation-errors-superset-docs"
        tags                                  = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
        # (21 unchanged attributes hidden)
    }

  # aws_lambda_permission.superset_docs will be created
  + resource "aws_lambda_permission" "superset_docs" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "cds-superset-docs"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # aws_route53_health_check.superset_docs will be destroyed
  # (because aws_route53_health_check.superset_docs is not in configuration)
  - resource "aws_route53_health_check" "superset_docs" {
      - arn                             = "arn:aws:route53:::healthcheck/5d446801-7f3d-4680-bd2e-273be959d5b3" -> null
      - child_health_threshold          = 0 -> null
      - child_healthchecks              = [] -> null
      - disabled                        = false -> null
      - enable_sni                      = true -> null
      - failure_threshold               = 5 -> null
      - fqdn                            = "l54guwdxgh73sks4datiovdlxa0yukqj.lambda-url.ca-central-1.on.aws" -> null
      - id                              = "5d446801-7f3d-4680-bd2e-273be959d5b3" -> null
      - invert_healthcheck              = false -> null
      - measure_latency                 = false -> null
      - port                            = 443 -> null
      - regions                         = [
          - "us-east-1",
          - "us-west-1",
          - "us-west-2",
        ] -> null
      - request_interval                = 30 -> null
      - resource_path                   = "/" -> null
      - tags                            = {
          - "CostCentre" = "cds-superset-docs-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                        = {
          - "CostCentre" = "cds-superset-docs-staging"
          - "Terraform"  = "true"
        } -> null
      - triggers                        = {} -> null
      - type                            = "HTTPS" -> null
        # (4 unchanged attributes hidden)
    }

  # module.superset_docs.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cds-superset-docs"
      ~ memory_size                    = 1024 -> 4096
        tags                           = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "DEBUG"              = "express:*" -> null
              - "RUST_LOG"           = "debug" -> null
                # (7 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_docs_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.superset_docs"]

20 tests, 18 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
